def zagadka ():
    a= input("Отгадайте загадку. Речка спятила с ума — По домам пошла сама.")
    str="водопровод"
    if print(a.lower()):
        print("Верно")
    else:
        print("Неправильно")
        
    b=input("Отгадайте загадку.Музыкант, певец, рассказчик — А всего труба да ящик.")
    str="граммафон"
    if print(b.lower()):
        print ("Верно")
    else:
        print("Неправильно")
        
        
    c=input("Отгадайте загадку. Из стены торчу, головой кручу, мою и пою целую семью.")
    str="водопроводный кран"
    if print(c.lower()):
        print ("Верно")
    else:
        print("Неправильно")
        
zagadka()
